БухЭксп/Catalogs/CW_МакросыШаблоновУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МакросыШаблоновУслуг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МониторинговыйПараметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_МакросыШаблоновУслуг/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстаноитьДоступностьВыбораРеквизитовПараметра();

КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)    
	
	ПустоеЗначение = Неопределено;
	Если ЗначениеЗаполнено(ТекущийОбъект.МониторинговыйПараметр) Тогда
		ПустоеЗначение = ТекущийОбъект.МониторинговыйПараметр.ТипЗначения.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	Если Не РеквизитыОбъектаДоступныДляВыбора(ТипЗнч(ПустоеЗначение)) Тогда
		ТекущийОбъект.РеквизитПараметра = "";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РеквизитПараметраНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	АдресСхемы = ПолучитьАдресСхемы();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресСхемы", АдресСхемы);   
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборРеквизита", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_МакросыШаблоновУслуг.Форма.ДоступныеПоля", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗавершитьВыборРеквизита(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.РеквизитПараметра = РезультатВыбора;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСхемы() 
	
	//Реквизит грузоперевозки(0), Мониторинговый параметр(1), Фиксированное значение(2), Формула(3)
	ТипПараметра = Объект.МониторинговыйПараметр.ТипЗначения.Типы()[0];
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипПараметра) Тогда    
		ТипДанныхXML = XMLТип(ТипПараметра); 
		ИмяТипа	     = СтрЗаменить(ТипДанныхXML.ИмяТипа, "CatalogRef.", "");
	КонецЕсли;
	
	Если ИмяТипа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СхемаКомпоновкиДанных 	= Справочники.CW_МакросыШаблоновУслуг.ПолучитьМакет("СхемаРеквизитов"); 
	ТекстЗапроса 			= СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;    
	ТекстЗапроса 			= СтрЗаменить(ТекстЗапроса, "ИмяСправочника", ИмяТипа);
	
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;	
	
	Возврат ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
КонецФункции


&НаКлиенте
Процедура МониторинговыйПараметрПриИзменении(Элемент)
	УстаноитьДоступностьВыбораРеквизитовПараметра();
КонецПроцедуры 

&НаСервере
Процедура УстаноитьДоступностьВыбораРеквизитовПараметра()
	
	ПустоеЗначение = Неопределено;
	Если ЗначениеЗаполнено(Объект.МониторинговыйПараметр) Тогда
		ПустоеЗначение = Объект.МониторинговыйПараметр.ТипЗначения.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	Элементы.РеквизитПараметра.Видимость = РеквизитыОбъектаДоступныДляВыбора(ТипЗнч(ПустоеЗначение)); 
	
КонецПроцедуры

Функция РеквизитыОбъектаДоступныДляВыбора(ТипЗначения) 
	
	Если ТипЗначения = Тип("Неопределено") Тогда
		Возврат ложь;
	КонецЕсли;
	
	Возврат Справочники.ТипВсеСсылки().СодержитТип(ТипЗначения);

КонецФункции
